<center><h1 style="background-color: #C6F3CD; border-radius: 10px; color: #FFFFFF; padding: 5px;">
DataFrame
</h1><center/>

**Link to the article** :  https://medium.com/@soulawalid/pandas-tutorial-i-2024-update-ba16016a44a7?sk=4b3233fef5d83c52ac1def833e3e33ff

In [1]:
import pandas as pd

In [5]:
# 1 - Creation
data = {
    'Years of Experience': [1, 3, 5, 7, 9],
    'Salary': [45000, 55000, 65000, 75000, 85000]
}

df = pd.DataFrame(data)
df

   Years of Experience  Salary
0                    1   45000
1                    3   55000
2                    5   65000
3                    7   75000
4                    9   85000

In [15]:
df2 = pd.DataFrame({
    'Years of Experience': [1, 3, 5, 7, 9],
    'Salary': [45000, 55000, 65000, 75000, 85000]
})
df2

   Years of Experience  Salary
0                    1   45000
1                    3   55000
2                    5   65000
3                    7   75000
4                    9   85000

In [11]:
# First two rows
df.head(2)

   Years of Experience  Salary
0                    1   45000
1                    3   55000

In [10]:
# Last two rows
df.tail(2)

   Years of Experience  Salary
3                    7   75000
4                    9   85000

In [16]:
# Columns only
df.columns

Index(['Years of Experience', 'Salary'], dtype='object')

In [21]:
# Index
df.index.tolist()

[0, 1, 2, 3, 4]

In [22]:
df.iloc[0]

Years of Experience        1
Salary                 45000
Name: 0, dtype: int64

In [23]:
# Info about the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Years of Experience  5 non-null      int64
 1   Salary               5 non-null      int64
dtypes: int64(2)
memory usage: 212.0 bytes

In [24]:
# Descriptive Statistics
df.describe()

       Years of Experience        Salary
count             5.000000      5.000000
mean              5.000000  65000.000000
std               3.162278  15811.388301
min               1.000000  45000.000000
25%               3.000000  55000.000000
50%               5.000000  65000.000000
75%               7.000000  75000.000000
max               9.000000  85000.000000

In [26]:
# Unique value
df.nunique()

Years of Experience    5
Salary                 5
dtype: int64

In [27]:
df['Salary'].nunique()

5

In [28]:
# Show the unique values
df['Salary'].unique()

array([45000, 55000, 65000, 75000, 85000], dtype=int64)

In [30]:
# Shape of the dataframe
df.shape

(5, 2)